<p>C&acirc;u đố tiếng anh, t&igrave;m từ bị ẩn trong bảng chữ c&aacute;i h&igrave;nh chữ nhật, l&agrave; một trong những c&acirc;u đố hay gi&uacute;p mọi người c&oacute; thể học nhanh từ vựng tiếng anh. C&acirc;u đố l&agrave; một bảng h&igrave;nh chữ nhật gồm NxM &ocirc;, mỗi &ocirc; chứa một k&yacute; tự thường từ a..z. Ch&uacute;ng ta c&oacute; nhiệm vụ l&agrave; t&igrave;m kiếm tr&ecirc;n từng h&agrave;ng v&agrave; tr&ecirc;n từng cột những &ocirc; li&ecirc;n tiếp m&agrave; nối với nhau th&igrave; tạo th&agrave;nh một từ tiếng anh c&oacute; nghĩa.</p>

<p>H&ocirc;m nay l&agrave; cuối tuần, Meow đang chơi c&acirc;u đố n&agrave;y. Tuy nhi&ecirc;n, ngo&agrave;i bảng chữ c&aacute;i sẽ c&ograve;n c&oacute; th&ecirc;m một tập danh s&aacute;ch gồm Q từ, mỗi từ c&oacute; đội d&agrave;i từ 2 đến 10 k&yacute; tự. Meow được y&ecirc;u cầu l&agrave; với mỗi từ trong danh s&aacute;ch, h&atilde;y x&aacute;c định xem từ đ&oacute; c&oacute; được ẩn dấu trong bảng chữ c&aacute;i hay kh&ocirc;ng?</p>

<p>V&igrave; bảng chữ c&aacute;i lớn n&ecirc;n Meow kh&ocirc;ng thể giải tr&ograve; chơi nhanh ch&oacute;ng được, c&aacute;c bạn lập tr&igrave;nh vi&ecirc;n h&atilde;y gi&uacute;p c&ocirc; ấy nh&eacute;!</p>

<p><strong>Đầu v&agrave;o:</strong></p>

<ul>
	<li>D&ograve;ng đầu ti&ecirc;n gồm 3 số nguy&ecirc;n dương N, M, Q thể hiện k&iacute;ch thước của bảng chữ nhật v&agrave; số lượng từ trong danh s&aacute;ch</li>
	<li>N d&ograve;ng tiếp theo, mỗi d&ograve;ng gồm M k&yacute; tự biểu diễn bảng chữ c&aacute;i</li>
	<li>Q d&ograve;ng tiếp theo, mỗi d&ograve;ng gồm một từ độ d&agrave;i từ 2 đến 10 k&yacute; tự</li>
</ul>

<p><strong>Đầu ra:</strong></p>

<ul>
	<li>gồm một d&ograve;ng duy nhất gồm Q k&yacute; tự. K&yacute; tự thứ i l&agrave; &#39;0&#39; nếu như từ thứ i kh&ocirc;ng xuất hiện trong bảng chữ c&aacute;i, ngược lại l&agrave; &#39;1&#39;</li>
</ul>

<p><strong>R&agrave;ng buộc:</strong></p>

<ul>
	<li><span class="math-tex">\(1 \leq N \times M \leq 10^5\)</span></li>
	<li><span class="math-tex">\(1 \leq Q \leq 10^4\)</span></li>
</ul>

<p><strong>V&iacute; dụ:</strong></p>

<p>&nbsp;</p>

<table>
	<tbody>
		<tr>
			<td colspan="1" rowspan="1">
			<p style="text-align:center"><strong>Đầu v&agrave;o </strong></p>
			</td>
			<td colspan="1" rowspan="1">
			<p style="text-align:center"><strong>Đầu ra </strong></p>
			</td>
		</tr>
		<tr>
			<td colspan="1" rowspan="1">
			<p>5 5 6</p>

			<p>kicko</p>

			<p>ffalg</p>

			<p>oboot</p>

			<p>campc</p>

			<p>ontes &nbsp;</p>

			<p>ff</p>

			<p>catp</p>

			<p>cao</p>

			<p>kick</p>

			<p>olo</p>

			<p>kfops</p>
			</td>
			<td colspan="1" rowspan="1">
			<p>101100</p>
			</td>
		</tr>
	</tbody>
</table>

<p>&nbsp;</p>